In [4]:
import pandas as pd

In [5]:
titanic_train = pd.read_csv("C:/Users/pc/Downloads/ai-level1/titanic/train.csv")
titanic_train.shape
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
titanic_train.groupby(['Sex','Embarked','Survived'])['Survived'].count()

Sex     Embarked  Survived
female  C         0             9
                  1            64
        Q         0             9
                  1            27
        S         0            63
                  1           140
male    C         0            66
                  1            29
        Q         0            38
                  1             3
        S         0           364
                  1            77
Name: Survived, dtype: int64

In [8]:
titanic_test = pd.read_csv("C:/Users/pc/Downloads/ai-level1/titanic/test.csv")
print(titanic_test.shape)
titanic_test.head()

(418, 11)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [9]:
titanic_test['Survived'] = None
titanic_test.loc[titanic_test.Sex == 'female', ['Survived']] = 1
titanic_test.loc[titanic_test.Sex == 'male', ['Survived']] = 0
titanic_test.loc[(titanic_test.Sex == 'male') and (titanic_test.Pclass==1), ['Survived']] = 1
titanic_test.head()

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
titanic_test.to_csv("C:/Users/pc/Downloads/ai-level1/titanic/submission1.csv", columns=["PassengerId", "Survived"], index=False)